In [16]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [2]:
file = "C:\\Users\\Katlic\\Documents\\LCO_Bootcamp\\python_projects\\machine_learning\\oyo_prediction\\oyo_data.csv"

In [3]:
df = pd.read_csv(file)

In [8]:
output = df['offered price']

In [9]:
output

0     2204
1     1216
2      739
3     1225
4      973
5      444
6     1014
7      469
8      929
9      710
10    1014
11     794
12    1216
13     497
14    2515
15     677
16    2376
17     522
18     800
19     628
Name: offered price, dtype: int64

In [12]:
training_data = df.drop(['Unnamed: 0','oyo hotel', 'address', 'offered price'], axis=1)

In [13]:
training_data

    ratings  original price
0       3.6            3673
1       4.6            2026
2       4.8            1231
3       3.9            2041
4       4.0            1621
5       3.6             740
6       4.1            1690
7       4.3             782
8       4.2            1548
9       3.7            1183
10      3.5            1690
11      3.1            1323
12      4.0            2026
13      4.0             828
14      4.5            4191
15      4.4            1401
16      4.3            3960
17      3.0             870
18      3.7            1333
19      3.4            1046

In [17]:
x_train, x_test, y_train, y_test = train_test_split(training_data, output, test_size=0.10, random_state = 42)

lr = LinearRegression()
lr.fit(x_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [18]:
lr.score(x_test,y_test)

0.9997575939208718

In [19]:
x_test

    ratings  original price
0       3.6            3673
17      3.0             870

In [20]:
y_test

0     2204
17     522
Name: offered price, dtype: int64

In [26]:
lr.predict([[3.6,3673]])

array([2219.73936049])